
import React from 'react';
import Section from './Section';

const StatementOfPurpose: React.FC = () => {
  return (
    <Section id="purpose" title="Statement of Purpose">
      <div className="max-w-4xl mx-auto bg-gray-800/50 p-8 rounded-lg shadow-lg">
        <h3 className="text-2xl font-bold text-center text-green-300 mb-6">ทำไมต้องวิทยาการคอมพิวเตอร์?</h3>
        <div className="text-gray-300 space-y-4 leading-relaxed text-left md:text-justify">
          <p>
            ผมมีความสนใจในคอมพิวเตอร์ตั้งแต่ยังเด็ก เนื่องจากในตอนเด็กนั้นผมมีความสนใจในเกมคอมพิวเตอร์เป็นอย่างมาก จึงมีความคิดอยากจะสร้างเกมเป็นของตนเอง ผมเรียนรู้การสร้างเกมจากการดัดแปลงโค้ดตัวเกมของเกมที่มีอยู่แล้ว เช่น Minecraft, GTA San Andreas, ฯลฯ จากการดัดแปลงตัวเกมเหล่านี้จึงทำให้ผมเข้าใจวิธีการทำงานของระบบตัวเกม Logic และวิธีการประมวลผลของตัวเกม
          </p>
          <p>
            ในช่วงชั้นประถมศึกษาปีที่ 4 ผมได้รับคัดเลือกในการเป็นตัวแทนไปแข่งขันการสร้างเกมสร้างสรรค์ ศิลปหัตถกรรมนักเรียน การแข่งขันนี้ทำให้ผมได้เรียนรู้หลายอย่างมาก ทั้งการใช้งานโปรแกรม Construct 2 วิธีการบันทึกข้อมูลของคอมพิวเตอร์ รวมทั้งการทำงานเป็นทีม แม้ว่าในปีนั้นผมยังไม่สามารถผ่านเข้ารอบเขตได้ แต่ประสบการณ์จากการแข่งขันทำให้ผมสามารถพัฒนาทักษะ และผ่านเข้าสู่การแข่งขันระดับชาติได้ในปีต่อ ๆ มา
          </p>
          <p>
            ผมได้รับคัดเลือกให้เป็นตัวแทนในการแข่งขันการสร้างหุ่นยนต์นอกสนาม SSK3 Smart AI Robotics Contest 2025 โดยทีมของผมเลือกหัวข้อการสร้างหุ่นยนต์แจ้งเตือนการเข้าเรียนของนักเรียนโดยใช้ระบบการสแกนใบหน้า การแข่งขันทำให้ผมได้รู้จักกับการทำงานของ SQL, APIs, Linux, Python ซึ่งเป็นสิ่งที่ผมไม่เคยได้เรียนรู้มาก่อน ผมจึงมีความสนใจในคอมพิวเตอร์มากยิ่งขึ้น
          </p>
          <p>
            การได้สร้างสรรค์ผลงาน นวัตกรรม และสิ่งประดิษฐ์ทำให้ผมได้เรียนรู้ว่าเทคโนโลยีเป็นสิ่งที่สำคัญกับมนุษย์มาก ผมจึงมั่นใจว่าวิทยาการคอมพิวเตอร์เป็นเส้นทางในการศึกษาที่เหมาะสมที่สุดสำหรับผม ผมตั้งใจที่จะนำความรู้และทักษะที่ได้เรียนรู้มาไปสร้างเทคโนโลยีใหม่ ๆ เพื่อสร้างประโยชน์ให้กับสังคมในอนาคต
          </p>
        </div>
      </div>
    </Section>
  );
};

export default StatementOfPurpose;
